In [3]:
import pandas as pd
import numpy as np

In [39]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                  index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
filter_names = ["animal", "age"]
filter_values = ["cat", 3]

In [51]:
print(df[(df[filter_names[0]] == filter_values[0]) & (df[filter_names[1]] < filter_values[1])])

   age animal    name priority  visits
a  2.5    cat  Murzik      yes       1
f  2.0    cat   Vaska       no       3

In [9]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                 index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
age_between = [2, 4]

In [10]:
df

   age animal     name priority  visits
a  2.5    cat   Murzik      yes       1
b  3.0    cat   Pushok      yes       3
c  0.5  snake      Kaa       no       2
d  NaN    dog    Bobik      yes       3
e  5.0    dog  Strelka       no       2
f  2.0    cat    Vaska       no       3
g  4.5  snake     Kaa2       no       1
h  NaN    cat    Murka      yes       1
i  7.0    dog     Graf       no       2
j  3.0    dog   Muhtar       no       1

In [26]:
print(df[(df['age'] >= age_between[0]) & (df['age'] <= age_between[1])])

   age animal    name priority  visits
a  2.5    cat  Murzik      yes       1
b  3.0    cat  Pushok      yes       3
f  2.0    cat   Vaska       no       3
j  3.0    dog  Muhtar       no       1

In [32]:
print(df[df['age'].between(*age_between, inclusive=True)])

   age animal    name priority  visits
a  2.5    cat  Murzik      yes       1
b  3.0    cat  Pushok      yes       3
f  2.0    cat   Vaska       no       3
j  3.0    dog  Muhtar       no       1

In [43]:
df = pd.DataFrame({'name' : ["Alex", "Bob", "Carmen", "Diaz", "Ella","Forman", "Glen"],
                   'age' : [20, 27, 35, 55, 18, 21, 35],
                   'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]})
index = 2

In [44]:
df

   age designation    name
0   20          VP    Alex
1   27         CEO     Bob
2   35         CFO  Carmen
3   55          VP    Diaz
4   18          VP    Ella
5   21         CEO  Forman
6   35          MD    Glen

In [45]:
df.loc[index, 'age'] += 1

In [46]:
print(df)

   age designation    name
0   20          VP    Alex
1   27         CEO     Bob
2   36         CFO  Carmen
3   55          VP    Diaz
4   18          VP    Ella
5   21         CEO  Forman
6   35          MD    Glen

In [48]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                 index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [49]:
df.age

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    2.0
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

In [64]:
for var in df.index:
    df.loc[var, 'age'] += 1
print(df)

    age animal     name priority  visits
a   6.5    cat   Murzik      yes       1
b   7.0    cat   Pushok      yes       3
c   4.5  snake      Kaa       no       2
d   NaN    dog    Bobik      yes       3
e   9.0    dog  Strelka       no       2
f   6.0    cat    Vaska       no       3
g   8.5  snake     Kaa2       no       1
h   NaN    cat    Murka      yes       1
i  11.0    dog     Graf       no       2
j   7.0    dog   Muhtar       no       1

In [4]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                 index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [5]:
df

   age animal     name priority  visits
a  2.5    cat   Murzik      yes       1
b  3.0    cat   Pushok      yes       3
c  0.5  snake      Kaa       no       2
d  NaN    dog    Bobik      yes       3
e  5.0    dog  Strelka       no       2
f  2.0    cat    Vaska       no       3
g  4.5  snake     Kaa2       no       1
h  NaN    cat    Murka      yes       1
i  7.0    dog     Graf       no       2
j  3.0    dog   Muhtar       no       1

In [14]:
print(df.age.sum())
((df.age*2+5+df.visits)**2).sum()

27.5

1624.0